/**
 * 随机文本工具
 * lxrmido@lxrmido.com
 */

var Dict = (function(){

	var Dict = {
		// 词汇表
		words : {
			nLoc1 : ['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','宝山区','闵行区','嘉定区','松江区','金山区','青浦区','南汇区','奉贤区','崇明县','浦东新区','东城区','西城区','崇文区','宣武区','朝阳区','海淀区','丰台区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区','密云县','延庆县','门头沟区','石景山区','和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','北辰区','津南区','武清区','宝坻区','静海县','宁河县','蓟县','辛集市','藁城市','晋州市','新乐市','鹿泉市','平山县','井陉县','栾城县','正定县','行唐县','灵寿县','高邑县','赵县','赞皇县','深泽县','无极县','元氏县','唐山市','遵化市','迁安市','迁西县','滦南县','玉田县','唐海县','乐亭县','滦县','昌黎县','卢龙县','抚宁县','邯郸市','武安市','邯郸县','永年县','曲周县','馆陶县','魏县','成安县','大名县','涉县','鸡泽县','邱县','广平县','肥乡县','临漳县','磁县','邢台市','南宫市','沙河市','邢台县','柏乡县','任县','清河县','宁晋县','威县','隆尧县','临城县','广宗县','临西县','内丘县','平乡县','巨鹿县','新河县','南和县','保定市','涿州市','定州市','安国市','满城县','清苑县','涞水县','阜平县','徐水县','定兴县','唐县','高阳县','容城县','涞源县','望都县','安新县','易县','曲阳县','蠡县','顺平县','博野县','雄县','宣化县','康保县','张北县','阳原县','赤城县','沽源县','怀安县','怀来县','崇礼县','尚义县','蔚县','涿鹿县','万全县','承德市','承德县','兴隆县','隆化县','平泉县','滦平县','沧州市','泊头市','任丘市','黄骅市','河间市','沧县','青县','献县','东光县','海兴县','盐山县','肃宁县','南皮县','吴桥县','廊坊市','霸州市','三河市','固安县','永清县','香河县','大城县','文安县','衡水市','冀州市','深州市','饶阳县','枣强县','故城县','阜城县','安平县','武邑县','景县','武强县','石家庄市','张家口市','高碑店市','秦皇岛市','大厂回族自治县','青龙满族自治县','丰宁满族自治县','宽城满族自治县','孟村回族自治县','围场满族蒙古族自治县','太原市','古交市','阳曲县','清徐县','娄烦县','大同市','大同县','天镇县','灵丘县','阳高县','左云县','广灵县','浑源县','阳泉市','平定县','盂县','长治市','潞城市','长治县','长子县','平顺县','襄垣县','沁源县','屯留县','黎城县','武乡县','沁县','壶关县','晋城市','高平市','泽州县','陵川县','阳城县','沁水县','朔州市','山阴县','右玉县','应县','怀仁县','晋中市','介休市','昔阳县','灵石县','祁县','左权县','寿阳县','太谷县','和顺县','平遥县','榆社县','运城市','河津市','永济市','闻喜县','新绛县','平陆县','垣曲县','绛县','稷山县','芮城县','夏县','万荣县','临猗县','忻州市','原平市','代县','神池县','五寨县','五台县','偏关县','宁武县','静乐县','繁峙县','河曲县','保德县','定襄县','岢岚县','临汾市','侯马市','霍州市','汾西县','吉县','安泽县','大宁县','浮山县','古县','隰县','襄汾县','翼城县','永和县','乡宁县','曲沃县','洪洞县','蒲县','吕梁市','孝义市','汾阳市','文水县','中阳县','兴县','临县','方山县','柳林县','岚县','交口县','交城县','石楼县','武川县','包头市','固阳县','乌海市','赤峰市','宁城县','林西县','敖汉旗','开鲁县','通辽市','库伦旗','奈曼旗','乌审旗','杭锦旗','根河市','阿荣旗','五原县','磴口县','丰镇市','兴和县','卓资县','商都县','凉城县','化德县','多伦县','正蓝旗','镶黄旗','兴安盟','突泉县','托克托县','清水河县','喀喇沁旗','巴林左旗','翁牛特旗','巴林右旗','扎鲁特旗','准格尔旗','鄂托克旗','达拉特旗','满洲里市','牙克石市','扎兰屯市','杭锦后旗','四子王旗','阿巴嘎旗','太仆寺旗','正镶白旗','阿尔山市','扎赉特旗','阿拉善盟','额济纳旗','呼和浩特市','和林格尔县','土默特左旗','土默特右旗','克什克腾旗','霍林郭勒市','鄂尔多斯市','伊金霍洛旗','鄂托克前旗','呼伦贝尔市','额尔古纳市','陈巴尔虎旗','巴彦淖尔市','乌拉特中旗','乌拉特前旗','乌拉特后旗','乌兰察布市','锡林浩特市','二连浩特市','苏尼特左旗','苏尼特右旗','锡林郭勒盟','乌兰浩特市','阿拉善左旗','阿拉善右旗','阿鲁科尔沁旗','新巴尔虎左旗','新巴尔虎右旗','鄂伦春自治旗','西乌珠穆沁旗','东乌珠穆沁旗','科尔沁左翼中旗','科尔沁左翼后旗','鄂温克族自治旗','察哈尔右翼前旗','察哈尔右翼中旗','察哈尔右翼后旗','科尔沁右翼前旗','科尔沁右翼中旗','达尔罕茂明安联合旗','莫力达瓦达斡尔族自治旗','沈阳市','新民市','法库县','辽中县','康平县','大连市','庄河市','长海县','鞍山市','海城市','台安县','抚顺市','抚顺县','本溪市','丹东市','东港市','凤城市','锦州市','凌海市','北宁市','黑山县','义县','营口市','盖州市','阜新市','彰武县','辽阳市','灯塔市','辽阳县','盘锦市','盘山县','大洼县','铁岭市','开原市','铁岭县','昌图县','西丰县','朝阳市','凌源市','北票市','朝阳县','建平县','兴城市','绥中县','建昌县','大石桥市','瓦房店市','普兰店市','调兵山市','葫芦岛市','岫岩满族自治县','清原满族自治县','新宾满族自治县','阜新蒙古族自治县','宽甸满族自治县','桓仁满族自治县','本溪满族自治县','喀喇沁左翼蒙古族自治县','长春市','九台市','榆树市','德惠市','农安县','吉林市','舒兰市','桦甸市','蛟河市','磐石市','永吉县','四平市','双辽市','梨树县','辽源市','东辽县','东丰县','通化市','集安市','通化县','辉南县','柳河县','白山市','临江市','靖宇县','抚松县','江源县','松原市','乾安县','长岭县','扶余县','白城市','大安市','洮南市','镇赉县','通榆县','延吉市','图们市','敦化市','龙井市','珲春市','和龙市','安图县','汪清县','公主岭市','梅河口市','伊通满族自治县','长白朝鲜族自治县','延边朝鲜族自治州','前郭尔罗斯蒙古族自治县','阿城市','尚志市','双城市','五常市','方正县','宾县','依兰县','巴彦县','通河县','木兰县','延寿县','讷河市','富裕县','拜泉县','甘南县','依安县','克山县','泰来县','克东县','龙江县','鹤岗市','萝北县','绥滨县','集贤县','宝清县','友谊县','饶河县','鸡西市','密山市','虎林市','鸡东县','大庆市','林甸县','肇州县','肇源县','漠河县','伊春市','铁力市','嘉荫县','宁安市','海林市','穆棱市','林口县','东宁县','同江市','富锦市','桦川县','抚远县','桦南县','汤原县','勃利县','黑河市','北安市','逊克县','嫩江县','孙吴县','绥化市','安达市','肇东市','海伦市','绥棱县','兰西县','明水县','青冈县','庆安县','望奎县','呼玛县','塔河县','七台河市','双鸭山市','牡丹江市','佳木斯市','绥芬河市','哈尔滨市','齐齐哈尔市','五大连池市','杜尔伯特蒙古族自治县','南京市','溧水县','高淳县','无锡市','江阴市','宜兴市','徐州市','邳州市','新沂市','铜山县','睢宁县','沛县','丰县','常州市','金坛市','溧阳市','苏州市','常熟市','太仓市','昆山市','吴江市','南通市','如皋市','通州市','海门市','启东市','海安县','如东县','东海县','灌云县','赣榆县','灌南县','淮安市','涟水县','洪泽县','金湖县','盱眙县','盐城市','东台市','大丰市','建湖县','响水县','阜宁县','射阳县','滨海县','扬州市','高邮市','江都市','仪征市','宝应县','镇江市','丹阳市','扬中市','句容市','泰州市','泰兴市','姜堰市','靖江市','兴化市','宿迁市','沭阳县','泗阳县','泗洪县','连云港市','张家港市','杭州市','建德市','富阳市','临安市','桐庐县','淳安县','宁波市','余姚市','慈溪市','奉化市','宁海县','象山县','温州市','瑞安市','乐清市','永嘉县','洞头县','平阳县','苍南县','文成县','泰顺县','嘉兴市','海宁市','平湖市','桐乡市','嘉善县','海盐县','湖州市','长兴县','德清县','安吉县','绍兴市','诸暨市','上虞市','嵊州市','绍兴县','新昌县','金华市','兰溪市','义乌市','东阳市','永康市','武义县','浦江县','磐安县','衢州市','江山市','龙游县','常山县','开化县','舟山市','岱山县','嵊泗县','台州市','临海市','玉环县','天台县','仙居县','三门县','丽水市','龙泉市','缙云县','青田县','云和县','遂昌县','松阳县','庆元县','景宁畲族自治县','合肥市','长丰县','肥东县','肥西县','芜湖市','芜湖县','南陵县','繁昌县','蚌埠市','怀远县','固镇县','五河县','淮南市','凤台县','当涂县','淮北市','濉溪县','安庆市','桐城市','宿松县','枞阳县','太湖县','怀宁县','岳西县','望江县','潜山县','黄山市','休宁县','歙县','祁门县','黟县','滁州市','天长市','明光市','全椒县','来安县','定远县','凤阳县','阜阳市','界首市','临泉县','颍上县','阜南县','太和县','宿州市','萧县','泗县','砀山县','灵璧县','巢湖市','含山县','无为县','庐江县','和县','六安市','寿县','霍山县','霍邱县','舒城县','金寨县','亳州市','利辛县','涡阳县','蒙城县','池州市','东至县','石台县','青阳县','宣城市','宁国市','广德县','郎溪县','泾县','旌德县','绩溪县','马鞍山市','福州市','福清市','长乐市','闽侯县','闽清县','永泰县','连江县','罗源县','平潭县','厦门市','莆田市','仙游县','三明市','永安市','明溪县','将乐县','大田县','宁化县','建宁县','沙县','尤溪县','清流县','泰宁县','泉州市','石狮市','晋江市','南安市','惠安县','永春县','安溪县','德化县','金门县','漳州市','龙海市','平和县','南靖县','诏安县','漳浦县','华安县','东山县','长泰县','云霄县','南平市','建瓯市','邵武市','建阳市','松溪县','光泽县','顺昌县','浦城县','政和县','龙岩市','漳平市','长汀县','武平县','上杭县','永定县','连城县','宁德市','福安市','福鼎市','寿宁县','霞浦县','柘荣县','屏南县','古田县','周宁县','武夷山市'],
			nLoc2 : ['阿巴丹','阿巴斯港','阿比让','阿伯丁郡','阿布扎比','阿德莱德','阿德雷德港','阿尔巴尼亚','阿尔汉格尔斯克','阿尔赫西拉斯','阿尔及尔','阿尔及利亚','阿芬默斯','阿根廷','阿加迪尔','阿加尼亚','阿卡胡特拉','阿卡普尔科','阿克拉','阿里卡','阿联酋','阿曼','阿姆斯特丹','阿帕帕','阿皮亚','阿萨布','阿什杜德','埃及','埃塞俄比亚','爱尔兰','爱沙尼亚','安的列斯','安的列斯荷属','安哥拉','安科纳','安曼','安纳巴','安特卫普','安提瓜和巴布达','安托法加斯塔','敖德萨','奥尔堡','奥尔胡斯','奥克兰','奥腊涅斯塔德','奥兰','奥勒松','奥卢','奥斯陆','奥文多','澳大利亚','澳尔塔','澳门','澳新','澳新线','巴巴多斯','巴布亚新几内亚','巴东','巴尔','巴尔博亚','巴尔的摩','巴哈马','巴哈马联邦','巴基斯坦','巴拉那瓜','巴兰基利亚','巴林','巴拿马','巴拿马城','巴拿马运河','巴纳纳','巴塞罗那','巴生港','巴士拉','巴塔','巴特沃斯','巴西','百慕大群岛','班加西','班珠尔','磅逊','保加利亚','卑尔根','北美','北欧','北欧线','贝尔法斯特','贝尔莫潘','贝拉','贝鲁特','贝伦','贝宁','本地治里','比雷艾夫斯','比利时','比塞大','比绍','毕尔巴鄂','辟利洛','槟城','冰岛','波多黎各','波多诺伏','波尔多','波兰','波士顿','波斯湾','波特兰','伯贝拉','伯尔尼','伯方','伯肯黑德','伯利兹','伯尼','勃生','博马','不来梅哈芬','不莱梅','布埃纳文图拉','布尔加斯','布兰卡港','布雷斯特','布里奇顿','布里斯班','布里斯托尔','布林迪西','布什尔','布宜诺斯艾利斯','查尔斯顿','查墨斯港','长崎','长滩','朝鲜','彻奇尔','赤道几内亚','川崎','达尔贝达','达尔文','达喀尔','达卡','达拉斯','达累斯萨拉姆','达曼','达米埃塔','达尼丁','大阪','大连','丹吉尔','丹麦','丹绒不碌','德班','德国','德里亚斯特','德山','的黎波里','迪拜','底特律','地中海','蒂华纳','蒂马鲁','东非','东京','东伦敦','东南亚','东亚','都柏林','都拉斯','斗湖','杜阿拉','杜蒂戈林','杜赛尔多夫','敦贺','敦刻尔克','多佛尔','多哥','多哈','多伦多','多明及加共和国','俄罗斯','厄瓜多尔','恩塞纳达','法国','法兰克福','法兰西堡','法罗拉','非洲','菲律宾','腓特烈斯塔','腓特烈西亚','斐济群岛','费城','费力克斯托','费尼克斯','芬兰','丰沙尔','佛得角','佛里曼特尔','弗里波特','弗里敦','符拉迪沃斯托克','福冈','福克兰群岛','福山','福斯','福州','釜山','富纳富提','富山','盖姆利克','冈比亚','刚果','高雄','戈特霍布','哥本哈根','哥德堡','哥伦比亚','哥伦布','哥斯达黎加','格但斯克','格丁尼亚','格拉斯哥','格兰杰默斯','格林纳达','格陵兰','根特','古巴','古晋','瓜达尔','瓜达拉哈拉','瓜德罗普岛','瓜亚基尔','瓜伊马斯','关丹','关岛','光阳','广岛','广州','圭亚那','哈尔姆斯塔德','哈科特港','哈立法克斯','哈密尔顿','哈瓦那','海底','海法','海防','海口','涵馆','汉堡','豪尔费坎','豪格松','河内','荷兰','荷兰港','荷台达','赫尔','赫尔辛堡','赫尔辛格','赫尔辛基','黑角','横滨','红海','洪都拉斯','鸿基','胡志明市','黄埔','惠灵顿','霍巴特','霍尔姆斯克','霍拉姆沙赫尔','霍梅尼港','霍尼亚拉','基尔','基辅','基里巴斯','基隆','基斯马尤','及内比亚绍','吉布提','吉达','吉大港','吉朗','吉隆坡','几内亚','加的夫','加的斯','加尔各答','加拉加斯','加莱角','加里宁格勒','加拿大','加那利群岛','加纳','加纳利群岛','加蓬','柬埔寨','焦亚陶罗','杰贝阿里','杰拉','捷克逊维尔','金边','金斯顿','金泽','锦普','井里文','井里汶','境港','酒田','巨港','喀麦隆','卡贝略港','卡宾达','卡尔德拉港','卡基纳达','卡拉奇','卡利亚里','卡萨布兰卡','卡斯特里港','卡塔尔','卡塔赫纳','卡维恩','卡亚俄','卡宴','开普顿','堪萨斯城','坎布里奇','坎德拉','康斯坦察','科克','科林托','科隆','科伦坡','科摩罗','科纳克里','科佩尔','科钦','科特迪瓦','科特卡','科托努','科威特','克赖斯特彻奇','克里斯琴斯特德','克里斯托巴尔','克利夫兰','克鲁斯格兰德','克努托内','肯布兰','肯尼亚','库达特','库马纳','夸察夸尔科斯','魁北克','坤甸','拉巴斯','拉巴特','拉布安纳闽','拉佛纳','拉各斯','拉瓜伊拉','拉科鲁尼亚','拉罗歇尔','拉普拉塔','拉萨罗卡德纳斯','拉斯帕尔马斯','拉斯佩齐亚','拉塔基亚','拉脱维亚','拉希德港','腊包尔港','来航','莱城','兰凯斯特','朗塞斯顿','劳托卡','勒哈弗尔','雷克雅未克','雷鸟尼翁','累西腓','黎巴嫩','里奥格兰德','里加','里斯本','里耶卡','里约热内卢','利比里亚','利比亚','利伯维尔','利马索尔','利蒙','利蒙港','利特尔顿','利物浦','连云港','林查班','林迪','留尼汪岛','卢贝克','鹿儿岛','鹿特丹','路易港','伦敦','伦敦德里','罗安达','罗马尼亚','罗斯托克','洛伦索马贵斯马普托','洛美','洛杉矶','马辰','马达加斯加','马丹','马但萨斯','马德拉群岛','马德拉斯','马德里','马德普拉塔','马尔代夫','马尔默','马耳他','马拉博','马拉加','马拉开波','马来西亚','马累','马利亚纳群岛','马林迪','马六甲','马瑙斯','马尼拉','马普托','马任加','马萨特兰','马萨瓦','马赛','马斯喀特','马塔迪','马提尼克岛','马希','迈阿密','麦纳麦','曼彻斯特','曼谷','曼萨尼约','曼萨尼约角','曼塔','毛淡棉','毛里求斯岛','毛利塔尼亚','梅尔辛','美东','美姑','美国','门司','蒙巴萨','蒙得维的亚','蒙罗维尔','蒙特雷','蒙特利尔','蒙特塞拉特岛','孟菲斯','孟加拉','孟加拉湾','孟买','米德尔斯伯勒','米德兰','米尔福德港','米里','米纳卡布斯','秘鲁','缅甸','名古屋','明德卢','摩尔曼斯克','摩加迪沙','摩洛哥','莫比尔','莫尔兹比港','莫桑比克','莫斯科','墨尔本','墨西哥','墨西哥城','墨西拿','木察木杜','木卡拉','木浦','穆哈','穆卡拉','穆斯塔加奈','拿骚','内尔逊','内皮尔','那坝','那不勒斯','纳霍德卡','纳米比亚','南安普敦','南澳洲','南非','南韩','南京','南美','南浦','南圣胡安','南圣克鲁斯','南斯拉夫','南特','南通','瑙鲁','尼加拉瓜','尼科西亚','尼日利亚','宁波','纽波特','纽黑文','纽卡斯尔','纽瓦克','纽约','努库阿洛法','努美阿','努瓦克肖特','挪威','诺福克','诺劳','诺沃西比尔斯克新西伯利亚','欧洲','帕果帕果','帕拉马里博','帕皮提','派塔','彭塔阿雷纳斯','彭塔雷纳斯','蓬塞','皮特尔角','珀斯','葡萄牙','朴次茅斯','普拉亚','普列茅斯','普洛切','千叶','乔治敦','钦博特','青岛','清律','清水','热那亚','仁川','日本','日惹','柔佛巴鲁','瑞典','瑞士','萨尔瓦多','萨凡纳','萨磨亚群岛','萨瓦','萨沃纳','塞德港','塞拉莱','塞拉利昂','塞内加尔','塞浦路斯','塞萨洛尼基','塞舌尔','塞舌尔加拿大','三宝垄','三藩市','桑德威奇','桑给巴尔','桑托斯','沙璜','沙迦','沙特阿拉伯','山打根','上海','蛇口','神户','圣安东尼奥','圣彼得堡','圣但尼','圣地亚哥','圣迭戈','圣多美','圣多美和普林西比','圣多明各','圣费尔南多','圣胡安','圣胡赛','圣克鲁斯','圣劳伦斯','圣卢西亚','圣路易斯','圣洛伦索','圣乔治','圣吐','圣托马斯','圣文森特和格林纳丁斯','圣约翰','圣约翰斯','诗巫','什切青','水东','斯德哥尔摩','斯克基达','斯里巴加湾市','斯里兰卡','斯洛文尼亚','斯普利特','斯塔万格','斯坦利港','斯旺西','泗水','宋卡','苏丹','苏丹港','苏尔','苏里南','苏伊士','苏伊士港','宿务','所罗门群岛','所属地区','所属国家','索非亚','索马里','塔巴科','塔尔图斯','塔科马','塔拉瓦','塔兰托','塔利拉迪','塔林','塔马塔夫','塔希提岛','台北','台湾','台中','太子港','泰国','泰晤士港','檀香山','坦加','坦帕','坦皮科','坦桑尼亚','汤加','陶朗阿','特拉布宗','特拉维夫','特立尼达和多巴哥','特鲁希略','特马','天津','亭可马里','突尼斯','图阿以西纳','图尔库','图莱亚尔','图马科','图瓦卢','土耳其','土伦','瓦尔纳','瓦尔帕莱索','瓦莱塔','瓦伦西亚','瓦努阿图','瓦萨','瓦沙','万鸦老','望加锡','危地马拉','威廉斯塔德','威尼斯','威瓦克','韦腊克鲁斯','维多利亚','维多利亚港','维尔京群岛','维尔京群岛美属','维拉港','维斯比','维斯马','委内瑞拉','蔚山','温哥华','温州','文莱','沃尔维斯湾','乌拉圭','乌拉湾','乌姆赛义德','乌斯怀亚','吴港','西澳洲','西班牙','西班牙港','西北欧','西恩付戈斯','西非','西哈努克城','西萨磨亚群岛','西太平洋','西雅图','西亚','希洪','希腊','悉尼','夏洛特','夏洛特阿马利亚','厦门','暹罗湾','岘港','香港','小仓','小樽','新阿姆斯特丹','新奥尔良','新鸿','新加坡','新喀里多尼亚','新普利默斯','新西兰','新泻','兴南','休斯敦','叙利亚','牙买加','雅典','雅尔塔','雅加达','亚庇哥打基','亚丁','亚喀巴','亚历山大','亚速尔群岛葡属','亚特兰大','亚洲','烟台','仰光','也门','伊基克','伊拉克','伊朗','伊丽莎白港','伊洛','伊明赫姆船坞','伊斯肯德伦','伊斯坦布尔','伊兹密尔','以色列','意大利','印度','印度次大陆','印尼','英国','元山','约旦','约翰内斯堡','越南','扎伊尔','占小牧','湛江','芝加哥','直布罗陀','直江津','智利','中东','中国','中美','中南美','中文港口','珠海','阿拉伯联合酋长国','莱索托','美利坚合众国','平昌','阿里河镇','阿什哈巴德','阿布贾','阿巴','阿巴奥科罗','阿巴嘎旗','阿巴卡利基','阿巴坎市','阿巴尧省','阿坝县','阿班凯','阿拜昂','阿贝马马','阿本古鲁','塔那那利佛','廷布','塔什干','三城','杜尔伯特蒙古族自治县','阿富汗','阿河','阿巴拉契亚山','阿尔卑斯山','阿肯色河','阿姆河','阿塔卡马沙漠利','阿空加瓜山廷','安第斯山','安纳布尔纳峰','奥得河','亚拉巴马州','阿拉斯加州','亚利桑那州','阿肯色州','加利福尼亚州','科罗拉多州','康涅狄格州','特拉华州','佛罗里达州','欧洲联盟','佐治亚州','夏威夷','爱达荷州','伊利诺伊州','印第安纳州','艾奥瓦州','衣阿华州','堪萨斯州','路易斯安那州','缅因州','马塞诸塞州','麻省','马里兰州','密歇根州','密执安州','明尼苏达州','密西西比州','密苏里州','蒙大拿州','内华达州','新罕布什尔州','新泽西州','新墨西哥州','纽约州','北卡罗来州','北达科他州','俄亥俄州','俄克拉何马州','俄勒冈州','宾夕法尼亚州','罗得岛','南卡罗来州','南达科他州','田纳西州','得克萨斯州','犹他州','佛蒙特州','弗吉尼亚州','华盛顿州','西弗吉尼亚州','威斯康星州','攀牙湾','普吉岛'],
			nPerson1 : ['杨朝来','蒋平','唐灿华','马达','赵小雪','薛文泉','丁建伟','凡小芬','文明','文彭凤','王丽','王建华','王梓人','王震','王保真','王景亮','王丹','邓志勇','邓婕','尹会南','叶汝红','付伟娜','付双红','毕泗迁','孙平','毛华强','孙益奇','孙媛媛','伍婷','阳娣','阳倩莹','刘小梅','刘俊鸣','刘海兵','刘伟华','刘启龙','刘勇辉','吕红','朱智新','张建辉','李湘群','李自新','李俊','李娟','李君琳','李桂富','陈其虎','陈明','邵彩云','杨知','杨波','杨开基','杨友成','杨巧敏','杨国栋','罗新磊','罗美','罗咏梅','罗心悦','周婷','周灵灵','范文远','胡水洋','胡俊松','胡瑞','赵燕燕','赵静','赵红','袁滴','袁艳','郭迎新','唐薇','贾天华','黄孝志','梁建','彭虎','盛伟刚','谢敏','曾水秀','曾维干','曾晖','曾莹','蔡准','谭红','蔡滔','黎婷婷','燕良华','戴剑敏','谭位旭','佘季','刘婷','李莎','夏婷','王玲','谭黎','陈晟','肖杨','邓健','龙平','叶波','阳勇','刘超','张玲','张琴丽','李远焕','李勇','陈丽云','肖琼洁','吴卫国','杨欢','郑志强','贺小红','杨淅','杨浙','猫哥','李珍珍','李珍宝','李珍婆','珍珍婆','珍宝宝','李珍妹','珍哈宝','尹敏','马飞','飞哥','敏敏','敏敏姐','尹文','文子','杨隆','杨金','杨金金','杨金妹','金妹妹','珍妹妹','丁锦','丁开水','黎春慧','春慧','丹惠','吴丹惠','刘兰','兰猪','兰猪猪','唐志凤','段湘林','欧阳菲菲','欧阳育兰','谭特林','宋琳','李敖','艾朝瑛','艾福聪','艾静','艾男男','安斌','安春华','安灏超','安建华','安金春','安立君','安娜','安世立','安炜','安文一','敖卫','傲丹','巴广玉','巴岩','白桂','白剑','白玉芳','白云逸','白祖武','百元明','柏建阁','柏建群','柏君芝','柏梅花','柏夏倩','班大林','包聃霞','包国强','包含露','包汉平','包红江','包辉明','包佳','包坚军','包军','包骏','包莉萍','包敏','包其富','包琴','包琴芬','包蓉蕾','包维宁','包卫霞','包晓鸣','包晓燕','包鑫','包徐君','包妍','包兆信','包志虹','包柱红','鲍国栋','鲍宏钧','鲍华静','鲍辉军','鲍磊','鲍明道','鲍清晓','鲍秋菊','鲍士杰','鲍士英','鲍顽园','鲍薇斌','鲍贤敏','鲍贤优','卞晓玲','卞意炯','别晓霞','宾坚','薄静艳','薄盛山','薄夜芬','薄莹','薄莹华','卜芬芬','卜慧瑛','卜秋玉','卜焱','卜章绍','步晓杰','蔡红','蔡爱华','蔡蓓颖','蔡长志','蔡成香','蔡春英','蔡刚','蔡国辉','蔡海滨','蔡海燕','蔡红国','蔡宏浩','蔡华露','蔡焕成','蔡辉锐','蔡惠珠','蔡慧','曹倩倩','曹秋莹','曹群','曹人优','曹荣','曹淑蕊','曹双凤','曹顺','曹婷婷','曹威','曹为明','曹伟鹏','曹伟青','曹炜','曹文琴','曹先莲','曹小锋','曹小慧','曹小君','曹小林','曹小宁','曹晓旭','曹啸艳','曹鑫','曹雪静','曹岩','曹艳','曹燕','曹阳琴','曹洋','曹英妹','曹瑛颖','曹永康','曹瑜','曹玉虎','曹玉霞','曹云芹','曹云燕','曹韫陶','曹再平','曹昭富','曹振华','曹志方','邓月娥','邓月凤','邓月仙','邓正兴','邓志庸','邓智丽','邓卓建','狄彬','狄成竹','狄国民','邸春艳','刁同喜','刁一峰','刁云飞','刁兆峰','丁敏','丁爱娟','丁蓓','丁伯生','丁长云','丁春兴','丁东海','丁凤明','丁光','丁光尧','丁光月','丁桂春','丁国华','丁国章','丁海莉','丁海明','丁翰相','丁恒辉','丁唤玲','丁吉','丁建华','丁江安','丁进','丁娟','丁兰芳','丁兰兰','丁磊','丁丽韵','丁良洪','丁亮','丁琳','丁苗苗','丁明刚','丁宁','丁鹏','丁萍','丁奇儿','丁谦利','丁琴','王国周','蔡高茜','吴玉立','杜乾技','庄先瑞','丁山','李原','韩卓汝','李俊锦','钱厚达','顾逢智','陈王婧','蔡兴彬','吴夏思','王玉颖','谭至嘉','符玲娜','李娇清','徐光葵','王福宽','秦鑫','钟佳宏','李仪','谢学明','詹道楠','熊成媛','骆丽珍','钟辉煌','谢斯任','刘想','陈泽锦','陈陆伟','郭维政','张熙宝','李照伟','谢海秀','吴水波','蔡元皓','陈倩琪','陈仁文','陈艳丹','丛雨华','方小红','冯亚娃','符朝军','符世宝','符修宁','李聪哲','李雄丹','吴超群','梁定斌','芮选铖','符气鹏','曾佑能','岑王敏','李志凌','庞卿聪','羊振夫','黄奕宇','聂源','王承民','梁佳','杨其鹏','肖迅','欧哲崇','李耀基','林斯瑜','吴多铭','林开仁','符策鹄','林新栋','陈清海','麦秀佳','钟国标','陈祥庆','何传清','许联皓','钟锐','张维','李拔妹','陈渊博','刘业盛','周禄','孙国涛','周川淇','韩壁君','陈艳倩','陈雪龄','符淑霞','李阳','李定洲','陈名帅','莫世恒','胡仁能','杨元棚','王斯琦','林亚娜','高义','柯维典','谢卓衡','陈明晶','李琼燕','陈昭华','陈小娟','石金陇','黄瑶','谢伟','何昭澍','陈滢滢','曾慧','曾文丽','林方宇','马崇','崔凯','杨硕','林庚','蓝健','李书诗','林立标','杨暖','周英伦','周明','符有能','廖明善','陈一明','周德怿','吴松','陆宇翔','陈焕允','王良浩','陈雏月','黄莎莎','唐益颂','潘星旭','夏子雯','钟风转','陈云华','陈川海','李志裕','陈孟娥','陈希','吴洋','云永伟','陈嘉','赵娱','马茜','林月媛','邹德刚','杨达怡','曾燕福','黄慧','冯学玲','刘华杰','李先周','张石生','邱嘉添','吴星露','林毓峰','钟明月','陈成豪','欧先帅','李泉汕','韩石磊','周浩腾','陈垂安','吉蕊','刘远昊','柳道武','叶善国','刘金堂','黄麒龙','许邦林','蔡兴国','王汉泽','杨继昕','陈妹','冯振鑫','吴毓龙','吴一','熊思浩','曾德锋','黄意鹏','洪莲','李卓鹏','韩明','文智','董昊','陈洁卉','卢永亮','林师亮','莫祥壮','王纯赛','肖海菊','覃茂鑫','邓文静','钟海琳','陈慧芬','伍小妹','陈家鑫','汪用志','黄启茂','黄吉','顾春虹','周礼仁','徐旭','罗清仁','林玲','杨运鑫','李庆章','严雄亮','符哲程','王剑丰','周祥奋','周安业','符川洪','梁振铭','杨华泽','叶滋钦','曾庆靖','张海亮','冯行龙','郑江浩','吴毓贤','翁中文','王咸仁','李通畅','林智','李星艺','李珑升','徐济顺','孙绍南','梁定锐','罗明祺','曾翔','柯丹婷','陈敬婧','翁珠格','庄薇微','周春妹','邱霖','范高儒','李旺','李志学','云宇','房秋红','吴少琼','李小瑜','李孔莹','王子婷','冯明','欧阳兆莎','李文婷','杨凡','孙慧莹','李茂秋','吴敏敏','李燕文','林萍','雍璐瑶','张晓燕','叶晨兰','郭凤娇','林婧','李F蔓','董晓敏','李娇丽','朱唤云','吕宇珊','顾斌','李泓妮','符莹莹','符艺琳','符珊珊','洪虹','陈菁华','郑辰','陈帅','王俊彬','盘东斌','余康铭','王岚巍','莫茂若','邝云骏','吴恒俊','符传腾','李城隆','陈歆','梁宇','陈正道','周兰芯','韩佳彤','陈炬霖','羊文之','梁美川','符碧琦','王海超','符波亮','王英政','卢婵','王瑶丝','郑晓筠','陈珍妮','叶亚喜','谢善超','欧文静','陈云萍','符丽雅','李来玉','梁培','靳海龙','周琳','刘颖妮','卢传鹏','文森','羊林琳','黄雯','颜杨','吴婉婉','吴昕','黄玮琳','邓晶','卓书云','阮晓光','王仁','吴嘉敏','朱佩珠','宋丹萍','孙芳杰','周伟强','林鸿弟','王仕禄','曾雯','肖贝妮','陈妙甜','陈珩','朱泓伟','郑靓','许启英','符财志','陈淑芸','陈镜羽','林秋霞','陈瑶菲','庞鹏','吴琳曦','符雯雯','冯子珊','钱淅雯','符健','陈小康','李转','温海皎','王智炜','孙巍','吴文玲','吴幼玲','吴庆彬','孙祎量','黄晔','阮丽华','黄伟君','陈恋','王聪聪','吴钟文','高睿','韩欣','吴慧子','李白卉','梁振冲','张英龙','陈真娥','李晶晶','赖思荪','陈卜侨','唐诗','陈思雯','陈黛','吴丽柳','梁婕','吴文锋','韩鸿','陈昌临','贺佳','林青','陈小叶','闫明明','许环霞','王燕春','李苗','陈茜茜','林克峰','吴春虹','陈巧瑜','李焕青','陈文华','吴发多','何昕钰','莫壮伟','陈冬娜','周明霞','韩颖','文静','卢彩霞','黄铃','谭立婷','陈文乾','陈文兴','吴慧婷','曾凤辰','黄菲','乔宇翔','郑翠梅','刘蓉','杨娇','黄良冠','赖耀东','徐淑媚','庄发琦','陈梦灵','顾珩','刘长剑','祝育川','廖梦麟','蔡姗姗','林关平','林群','王业刚','谢越斌','谢柳雅','曾令祝','梁丁丹','苏琳','王赫','陈文宏','林小康','孙乐坚','马承旺','慈蕾','龙颖琪','郭智','王若斯','陈秀梅','周曼吉','吴坤聪','欧彦君','林子杰','吴育仁','王权','陈国标','谭文顺','陈盛','劳小翡','林翊','林小慧','吴玲玲','许环珊','邓小晶','柳羽茜','龙甫育','吴维雄','郑跃芳','吴奇富','吴淑胜','蒙雅','韦花玲','陈昌盛','刘苏南','杜惠文','詹达宝','李梁杰','王瑜','杨国学','王秀良','陈宝山','杜海强','梁林娟','唐帅','庄清秀','项天维','胡行周','王礼布','吴彩銮','杜家梁','林震','吴仁伟','林明安','吴庆平','袁羽青','符腾云','林月岭','王俊光','王景仟','陈声震','吴传植','彭学忠','陈景发','蔡于平','尤小瑜','冯艺','林齐文','周钟瑜','周贞刚','李姗珊','吴梅秋','符苑菲','潘丽妃','黄小娜','吴青','吴丽福','林坤','陈猷宗','廖选暖','李小宁','田斌','曾圣才','柯燕','吴钟强','邓献江','吴瑞珍','吴晓娴','王秀霞','邢姗姗','杜运仕','王美玲','周开贵','许志伟','周海丽','蔡於虎','陈丽娟','文巧妮','刘珊','陈隆','吴彩云','蒙波','杜琼文','王开佐','邓端裕','蔡姣锐','陈山青','吴正华','甘小娟','翁小莉','吴颖颖','杜正祥','吴清俊','冯学江','黄金妹','罗梅桂','蒙钟敏','吴师庆','吴坤达','吴淑福','陈明春','翁邦森','陈文湘','温国松','周汝鹏','陈元定','陈信润','钟慧英','梁锦','符畅慧','王恭美','王献杰','符式廷','杜坤望','周贞慧','袁凯','陈青选','周经福','柯端裴','王良','王明枢','邓盛明','吴仁程','王昊','王淑艳','金吉勇','关腾','符策敏','陈颖喜','吴伟铭','梁斌云','王春菊','冯淑芬','张钿玲','张裕松','洪绵亮','王茂林','苏运程','梁崇明','陈琳','王泽亭','明娇丹','陈昌伟','王荣镳','陈秀玉','郑世微','王慧','潘芊羽','陈颖妹','邓亚慧','曾佳佳','麦静娜','劳小玲','符慧超','唐学运','李川清','林倩茹','杜金荣','韦经珠','吴大峰','唐伟','林小莉','林来彬','符艳蝶','韦海燕','符扬','谭小婷','吴传平','庄志明','吴岳大','符实','翁军太','颜源','林志富','甘馨','王康羽','陈扬','梁其讯','符淑云','梁春燕','刘梦','周晓敏','吴多玲','韦泽康','韩钰茹','王任如','张镞远','符璨','刘泓含','王文祎','占亚吉','詹铠','卢蕃','黄赟','洪琬婷','黄祎天','郑亚传','符晓','吴泰政','黄赟博','刘谨铭','莫皓翔','王咪咪','曾德原','张家','庄多欤','符青霭','吴俊良','陈奕希','梁钎文','王童萱','叶嘉酩','冯子铭','邢钰婧','张舒淇','韩青芯','钟诗朦','于雯溪','詹懿南','王辉藜','陈思羽','刘祖立'],
			nUniv : ['清华大学','北京大学','北京航空航天大学','中国人民大学','中国政法大学','北京邮电大学','北京师范大学','北京理工大学','北京外国语大学','北京交通大学','对外经济贸易大学','北京大学医学部','京人民警察学院','中央财经大学','中国地质大学','北京科技大学','华北电力大学','中央民族大学','首都师范大学','北京林业大学','中国农业大学','北京语言大学','首都经济贸易大学','中国矿业大学','北方工业大学','中央广播电视大学','石油大学','北京化工大学','北京工商大学','北京中医药大学','中国人民公安大学','首都医科大学','北京工业大学','北京联合大学','北京体育大学','北京电子科技职业学院','中国青年政治学院','北京财贸职业学院','外交学院','北京联合大学应用文理学院','中国防卫科技学院','北京服装学院','中国协和医科大学','北京科技职业学院','天津大学','南开大学','天津师范大学','天津工业大学','天津医科大学','天津商业大学','天津外国语学院','中国民用航空学院','天津财经大学','天津理工大学','保定学院','张家口医学院','邯郸职业技术学院','张家口农业高等专科学校','邢台学院','承德医学院','邢台职业技术学院','东北大学秦皇岛分校','唐山师范学院','河北能源职业技术学院','廊坊师范学院','河北省职工医学院','沧州职业技术学院','保定职业技术学院','唐山学院','河北北方学院','河北交通职业技术学院','沧州师范专科学校','衡水学院','承德民族师范高等专科学校','河北金融学院','石家庄铁路职业技术学院','邯郸学院','河北工业职业技术学院','河北工程技术高等专科学校','承德民族职业技术学院','中央司法警官学院','华北电力大学科技学院','中国地质大学长城学院','北京经济技术职业学院','渤海石油职业学院','河北机电职业技术学院','河北软件职业技术学院','廊坊职业技术学院','石家庄东方美术职业学院','石家庄工商职业学院','石家庄信息工程学院','石家庄医学高等专科学校','唐山工业职业技术学院','唐山职业技术学院','张家口教育学院','张家口职业技术学院','河北化工医药职业技术学院','山西大学','太原理工大学','山西大同大学','山西职工医学院','山西综合职业技术学院','太原大学','山西生物应用职业技术学院','内蒙古大学','内蒙古师范大学','内蒙古民族大学','内蒙古财经学院','吉林大学','吉林师范大学','吉林农业大学','长春理工大学','吉林化工学院','长春工程学院','延边大学','长春税务学院国际交流学院','长春税务学院','吉林粮食高等专科学校','吉林商业高等专科学校','长春中医药大学','通化师范学院','吉林交通职业技术学院','吉林艺术学院','吉林工程技术师范学院','吉林建筑工程学院建筑装饰学院','长春医学高等专科学校','辽源职业技术学院','吉林农业科技学院','长春大学光华学院','长春工业大学人文信息学院','长春信息技术职业学院','吉林师范大学博达学院','吉林省体育学院未入网','吉林省经济管理干部学院','东北农业大学','东北林业大学','黑龙江大学','黑龙江八一农垦大学','哈尔滨商业大学','黑龙江科技学院','黑龙江中医药大学','哈尔滨工程大学','哈尔滨工业大学','哈尔滨医科大学','哈尔滨理工大学','哈尔滨师范大学','齐齐哈尔大学','哈尔滨医科大学附属第二医院','哈尔滨广播电视大学','黑龙江广播电视大学','哈尔滨学院','大庆石油学院','哈尔滨金融高等专科学校','哈尔滨体育学院','黑龙江工程学院','牡丹江师范学院','黑龙江畜牧兽医职业学院','哈尔滨市南岗教师进修学校','大庆石油华瑞学院','黑河学院','哈尔滨理工大学远东学院','黑龙江大学剑桥学院','大庆师范学院','哈尔滨师范大学恒星学院','复旦大学','上海交通大学','上海大学','同济大学','东华大学','华东师范大学','财经大学','上海第二工业大学','上海理工大学','水产大学','海事大学','海运大学','华东政法大学','广东工业大学','广东政法学院','广东外语外贸大学','上海外贸学院','上海外国语大学','杉达学院','华东理工大学','上海政法学院','上海师范大学','上海体育学院','第二军医大学','上海应用技术大学','上海工程技术大学','云南警官学院','云南中医学院','西南林学院'],
			nFest  : ['车公诞','元宵节','国际气象节','情人节','全国爱耳日','国际妇女节','植树节','国际警察日','国际消费者权益日','世界森林日','世界儿歌日','世界水日','世界气象日','世界防治结核病日','妈祖生辰','愚人节','清明节','世界卫生日','世界地球日','读者节','国际劳动节','中国青年节','碘缺乏病防治日','世界红十字日','国际护士日','国际母亲节','端午节','国际家庭日','国际助残日','世界电信日','国际博物馆日','全国学生营养日','国际牛奶日','全国助残日','世界无烟日','国际儿童节','世界环境日','全国爱眼日','父亲节','国际奥林匹克日','全国土地日','中国共产党诞生纪念日','世界建筑日','抗日战争纪念日','世界人口日','七夕情人节','建军日','中秋节','抗日战争胜利日','国际扫盲日','重阳节','教师节','国际臭氧层保护日','国际爱牙日','世界旅游日','国际聋人节','国庆节','国际音乐日','国际减轻自然灾害日','世界动物日','国际住房日','全国高血压日','世界邮政日','中国少先队建队日','国际盲人节','世界粮食日','世界消除贫困日','联合国日','现代世界足球诞生日','国际旅游电影节','中国记者日','消防宣传日','孙中山诞辰','世界糖尿病日','国际大学生节','毛泽东诞生','感恩节','世界艾滋病日','世界残疾人日','世界足球日','国际生物多样性日','腊八节','圣诞节','巴丹吉林沙漠旅游节','春节','防治沙漠化和干旱日','妇幼节','姑娘节','光棍节','广元女儿节','寒食节','火把节','姐妹节','开年','开斋节','美食节','母亲节','女儿节','女神节','泼水节','乞巧节','钱江观潮节','敲锣儿节','人日','三峡国际旅游节','世界禁毒日','桃花节','添仓节','仙女节','娅拜节','元旦','中元节'],
			nCap1 : ['领导','市民','游客','观光团','考察组','科考团'],
			nCap2 : ['学生','交流生','讲师','教授','副教授','研究生','导师','院长','主任'],
			nCap3 : ['市民','游客','学生','驴友'],
			nBeFnd : ['佛罗伦萨主教堂','米罗岛的维纳斯','初级疲劳恢复剂','阿布辛拜勒神庙','云南拟单性木兰','久病不愈的公爵','欧洲伯劳的发现','海神火焰投掷器','最伟大的航海家','武装快速突击舰','高级疲劳恢复剂','精炼的巨骨战刃','青龙圣剑设计图','庸兵皮甲设计图','女式海军上将帽','金龙火枪设计图','冰冷之原','遗忘之塔','内侧回廊','大教堂','崔斯特瑞姆','地下墓穴','皇宫','督瑞尔的房间','下水道','库拉斯特梯道','崔凡克','憎恨的囚牢','混沌避难所','尼拉塞克的神殿','亚瑞特山脉颠峰','毁灭的王座','世界之石大殿','强韧恶魔的邀请函','燃烧的心脏','撒勒的印章','上等碎骨','上级元素晶石','生锈的铁片','守护之印记','斯卡迪女王的印章','碎布片','无色大晶体','下级元素晶石','邪恶的结晶','亚瑞特的面容','加尔的长发','蛇魔法师之皮','海蛇皮甲','都瑞尔的壳'],
			nSubject : ['哲学','科学技术哲学','宗教学','美学','伦理学','逻辑学','外国哲学','中国哲学','马克思主义哲学','应用经济学','国民经济学','区域经济学','财政学含税收学','金融学含保险学','产业经济学','国际贸易学','劳动经济学','统计学','数量经济学','国防经济','理论经济学','政治经济学','经济思想史','经济史','西方经济学','世界经济','人口资源与环境经济学','马克思主义理论','马克思主义基本原理','马克思主义发展史','马克思主义中国化研究','国外马克思主义研究','思想政治教育','民族学','马克思主义民族理论与政策','中国少数民族经济','中国少数民族史','中国少数民族艺术','社会学','人口学','人类学','民俗学含中国民间文学','政治学','政治学理论','中外政治制度','中共党史含党的学说与党的建设','马克思主义理论与思想政治教育','国际政治','国际关系','外交学','法学理论','法律史','宪法学与行政法学','刑法学','诉讼法学','经济法学','环境与资源保护法学','军事法学教育学','体育人文社会学','体育教育训练学','民族传统体育学','心理学可授教育学理学学位','发展与教育心理学','应用心理学','教育学原理','课程与教学论','教育史','比较教育学','学前教育学','高等教育学','成人教育学','职业技术教育学','特殊教育学','教育技术学可授教育学理学学位','艺术学','音乐学','美术学','设计艺术学','戏剧戏曲学','电影学','广播电视艺术学','舞蹈学','新闻传播学','新闻学','传播学','外国语言文学','英语语言文学','俄语语言文学','法语语言文学','德语语言文学','日语语言文学','印度语言文学','西班牙语语言文学','阿拉伯语语言文学','欧洲语言文学','亚非语言文学','外国语言学及应用语言学','中国语言文学','文艺学','语言学及应用语言学','汉语言文字学','中国古典文献学','中国古代文学','中国现当代文学','中国少数民族语言文学分语族','比较文学与世界文学','历史学','史学理论及史学史','历史地理学','历史文献学含敦煌学古文字学','专门史','中国古代史','中国近现代史','世界史','数学','基础数学','计算数学','概率论与数理统计','应用数学','运筹学与控制论','物理学','理论物理','粒子物理与原子核物理','原子与分子物理','等离子体物理','凝聚态物理','声学','光学','无线电物理','化学','无机化学','分析化学','有机化学','物理化学含化学物理','高分子化学与物理','天体物理','天体测量与天体力学','自然地理学','人文地理学','地图学与地理信息系统','气象学','大气物理学与大气环境','海洋科学','物理海洋学','海洋化学','海洋生物学','海洋地质','地球物理学','固体地球物理学','空间物理学','地质学','矿物学岩石学矿床学','地球化学','古生物学与地层学含古人类学','构造地质学','第四纪地质学','生物学','植物学','动物学','生理学','水生生物学','微生物学','神经生物学','遗传学','发育生物学','细胞生物学','生物化学与分子生物学','生物物理学','生态学','系统科学','系统理论','系统分析与集成','力学可授工学理学学位','一般力学与力学基础','固体力学','流体力学','工程力学','机械工程','机械制造及其自动化','机械电子工程','机械设计及理论','车辆工程','仪器科学与技术','精密仪器及机械','测试计量技术及仪器','材料科学与工程','材料物理与化学','材料学','材料加工工程','冶金工程','冶金物理化学','钢铁冶金','有色金属冶金','动力工程及工程热物理','工程热物理','热能工程','动力机械及工程','流体机械及工程','制冷及低温工程','化工过程机械','电气工程','电机与电器','电力系统及其自动化','高电压与绝缘技术','电力电子与电力传动','电工理论与新技术','物理电子学','电路与系统','微电子学与固体电子学','电磁场与微波技术','信息与通信工程','通信与信息系统','信号与信息处理','控制科学与工程','控制理论与控制工程','检测技术与自动化装置','系统工程','模式识别与智能系统','导航制导与控制','计算机系统结构','计算机软件与理论','计算机应用技术','建筑历史与理论','建筑设计及其理论','建筑技术科学','岩土工程','结构工程','市政工程','供热供燃气通风及空调工程','防灾减灾工程及防护工程','桥梁与隧道工程','水文学及水资源','水力学及河流动力学','水工结构工程','水利水电工程','港口海岸及近海工程','测绘科学与技术','大地测量学与测量工程','摄影测量与遥感','地图制图学与地理信息工程','化学工程与技术','化学工程','化学工艺','生物化工','应用化学','工业催化','地质资源与地质工程','矿产普查与勘探','地球探测与信息技术','地质工程','矿业工程','采矿工程','矿物加工工程','安全技术及工程','石油与天然气工程','油气井工程','油气田开发工程','油气储运工程','纺织科学与工程','纺织工程','纺织材料与纺织品设计','纺织化学与染整工程','服装设计与工程','轻工技术与工程','制浆造纸工程','制糖工程','发酵工程','皮革化学与工程','交通运输工程','道路与铁道工程','交通信息工程及控制','交通运输规划与管理','载运工具运用工程','船舶与海洋工程','船舶与海洋结构物设计制造','轮机工程','水声工程','航空宇航科学与技术','飞行器设计','航空宇航推进理论与工程','航空宇航制造工程','人机与环境工程','兵器科学与技术','武器系统与运用工程','兵器发射理论与技术','火炮自动武器与弹药工程','军事化学与烟火技术','核科学与技术','核能科学与工程','核燃料循环与材料','核技术及应用','辐射防护及环境保护','农业工程','农业水土工程','农业生物环境与能源工程','农业电气化与自动化','林业工程','森林工程','木材科学与技术','林产化学加工工程','环境科学','环境工程','食品科学','粮食油脂及植物蛋白工程','农产品加工及贮藏工程','水产品加工及贮藏工程','农学','作物学','作物栽培学与耕作学','作物遗传育种','园艺学','果树学','蔬菜学','茶学','农业资源利用','土壤学','植物营养学','植物保护','植物病理学','农业昆虫与害虫防治','农药学可授农学理学学位','畜牧学','动物遗传育种与繁殖','动物营养与饲料科学','草业科学','特种经济动物饲养含蚕蜂等','兽医学','基础兽医学','预防兽医学','临床兽医学','林学','林木遗传育种','森林培育','森林保护学','森林经理学','野生动植物保护与利用','园林植物与观赏园艺','水土保持与荒漠化防治','水产','水产养殖','捕捞学','渔业资源','医学','基础医学可授医学理学学位','人体解剖与组织胚胎学','免疫学','病原生物学','病理学与病理生理学','法医学','放射医学','航空航天与航海医学','临床医学','妇产科学','眼科学','耳鼻咽喉科学','肿瘤学','康复医学与理疗学','运动医学','麻醉学','急诊医学','护理学','临床检验诊断学','影像医学与核医学','皮肤病与性病学','精神病与精神卫生学','神经病学','老年医学','儿科学','口腔医学','口腔基础医学','口腔临床医学','流行病与卫生统计学','劳动卫生与环境卫生学','营养与食品卫生学','儿少卫生与妇幼保健学','卫生毒理学','军事预防医学','中医学','中医基础理论','中医临床基础','中医医史文献','方剂学','中医诊断学','中医内科学','中医外科学','中医骨伤科学','中医妇科学','中医儿科学','中医五官科学','针灸推拿学','中西医结合','中西医结合基础','中西医结合临床','药学可授医学理学学位','药物化学','药剂学','生药学','药物分析学','微生物与生化药学','药理学','军事学','军事思想及军事历史','军事历史','战略学','军事战略学','战争动员学','战役学','联合战役学','军种战役学含第二炮兵战役学','战术学','合同战术学','兵种战术学','军队指挥学','作战指挥学','军事运筹学','军事通信学','军事情报学','密码学','军事教育训练学含军事体育学','军制学','军事组织编制学','军队管理学','军队政治工作学','军事后勤学与军事装备学','军事后勤学','后方专业勤务','军事装备学','管理学','工商管理','会计学','旅游管理','技术经济及管理','农林经济管理','农业经济管理','公共管理','行政管理','社会保障','土地资源管理','图书馆情报与档案管理','情报学','档案学'],
			prepT1 : ['在','于'],
			prepT2 : ['对','给'],
			prepT3 : ['对','就','针对'],
			actT1 : ['表达','送去','赠予','传达','给予'],
			actT2 : ['关怀','温暖','祝福','关切','关怀','友爱','和平','慰问'],
			actT3 : ['参观学习','观光见闻','愉快玩耍','欢度佳节','共度','游玩'],
			actT4 : ['发表演讲','组织座谈','发起讨论'],
			actT5 : ['发现','惊现','找到','偶遇']
		},
		// 句子格式
		sentenceFormats : [
			'{nFest}，{nLoc2}{nCap1}{prepT1}{nLoc1}{actT3}',
			'{nLoc1}{nCap1}{prepT2}{nLoc2}{nCap1}{actT1}{actT2}',
			'{nUniv}{nCap2}{prepT1}{nUniv|nLoc2}{prepT3}{nSubject|nBeFnd}{actT4}',
			'{nLoc2|nUniv}{nCap3}{prepT1}{nLoc2}{actT5}{nBeFnd}'
		],
		// 密码字符表
		keychars : "0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ",
		// 中文字符表
		alphabet : [
			'奏','春','帮','珍','玻','毒','型','挂','封','持','项','垮','挎','城','挠','政',
			'赴','赵','挡','挺','括','拴','拾','挑','指','垫','挣','挤','拼','挖','按','挥',
			'哪','炭','峡','罚','贱','贴','骨','钞','钟','钢','钥','钩','卸','缸','拜','看',
			'矩','怎','牲','选','适','秒','香','种','秋','科','重','复','竿','段','胞','胖',
			'脉','勉','狭','狮','独','狡','狱','狠','贸','怨','急','饶','蚀','饺','饼','弯',
			'将','奖','哀','亭','亮','度','迹','庭','疮','疯','疫','疤','洞','测','洗','活',
			'派','洽','染','济','洋','洲','浑','浓','津','恒','恢','恰','恼','恨','举','觉',
			'宣','室','宫','宪','突','穿','窃','客','冠','语','扁','袄','祖','神','祝','误',
			'诱','说','诵','垦','退','既','屋','昼','费','陡','眉','孩','除','险','院','娃',
			'姥','姨','姻','娇','怒','架','贺','盈','勇','怠','柔','垒','绑','绒','结','绕',
			'骄','绘','给','络','骆','绝','绞','统',
			'亏','士','工','土','才','寸','下','大','丈','与','车','巨','牙','屯',
			'比','互','切','瓦','止','少','日','中','冈','叶','甲','申','叮','电',
			'号','田','由','史','只','央','兄','权','过','臣','再','协','西','压',
			'厌','在','有','百','存','村','杏','极','李','杨','求','更','束','豆',
			'两','丽','医','辰','或','画','卧','事','刺','枣','雨','卖','矿','码',
			'厕','奔','秘','透','笔','笑','笋','债','借','值','倚','倾','倒','猜',
			'猪','猎','猫','猛','馅','馆','凑','减','毫','麻','痒','痕'
	    ],
	    // 中文标点符号表
	    punctuate : ['，','。','？','！','…', '；'],
	    // 随机一个密码字符
		randomKeyChar : function(){
			return this.randomOne(this.keychars);
		},
		// 随机一个中文字符
		randomChar : function(){
			return this.randomOne(this.alphabet);
		},
		// 随机一个标点符号
		randomPunctuate : function(){
	        return this.randomOne(this.punctuate);
	    },
	    // 随机一段中文文本
	    // punctuate = true 时生成标点
	    randomText : function(min, max, punctuate){
	        var pnb;
	        var n = Math.floor(Math.random() * (max - min)) + min;
	        var i, s, lp = -1;
	        s = util.randomChar();
	        for(i = 1; i < n; i ++){
	            if(punctuate && (lp != (i - 1))){
	                if(Math.random() > 0.1){
	                    s += util.randomChar();
	                }else{
	                    lp = i;
	                    s += util.randomPunctuate()
	                }
	            }else{
	                s += util.randomChar();
	            }
	        }
	        return s;
	    },
	    // 创建随机密码字符串
		createKey : function(length){
			var s = '';
			var i;
			for(i = 0; i < length; i ++){
			    s += this.randomKeyChar();
			}
			return s;
		},
		// 随机创建一个中文句子
		createSentence : function(){
			return Dict.decodeFormat(Dict.randomOne(Dict.sentenceFormats));
		},
		// 随机返回一个中文人名
		createPersonName : function(){
			return Dict.randomOne(Dict.words.nPerson1);
		},

		randomOne : function(x){
			return x[Math.floor(x.length * Math.random())];
		},

		decodeFormat : function(x){
			var i;
			var out = '';
			var word;
			var words;
			var inWord = false;
			for(i = 0; i < x.length; i ++){
				if(inWord){
					switch(x[i]){
						case '}':
							if(words){
								words.push(word);
								out += Dict.decodeWord(Dict.randomOne(words));
							}else{
								out += Dict.decodeWord(word);
							}
							inWord = false;
							words = null;
							word = null;							
							break;
						case '|':
							if(words){
								words.push(word);
							}else{
								words = [word];
							}
							word = '';
							break;
						default:
							word += x[i];
							break;
					}
				}else{
					switch(x[i]){
						case '{':
							inWord = true;
							word = '';
							break;
						default:
							out += x[i];
							break;
					}
				}
			}
			return out;
		},

		decodeWord : function(x){
			if(x in Dict.words){
				return Dict.randomOne(Dict.words[x]);
			}
			return '{' + x + '}';
		}
	};

	return Dict;

})();